<template>
<view>
  <view class="top">
    <text>{{oemName}}注册服务协议</text>
  </view>
  <view class="contre" style="white-space:pre-wrap">
    <p>亲爱的用户，欢迎使用{{oemName}}共享经济服务平台（“{{oemName}}小程序”或其他H5等开放平台，下称“{{oemName}}”），“{{oemName}}”是{{companyName}}及其关联公司<!-- （{{companyName}}蚌埠分公司、{{companyName}}繁昌分公司、九江指客云互联网科技有限公司） -->（下称“我司”）基于共享经济模式打造的灵活用工平台，感谢您选用“{{oemName}}”的各项服务。</p>
    您访问本平台、使用本平台的任何服务、在本平台内与其他用户的交流互动、发布任何信息及使用其他用户发布的任何信息等一切与本平台有关的活动和行为，均受到以下协议条款的约束和限制，请您务必仔细阅读。
    当您按照注册页面提示填写信息、阅读并同意本协议且完成全部注册程序后，即表示您已充分阅读、理解并接受本协议的全部内容，并与“{{oemName}}”达成协议。您承诺接受并遵守本协议的所有约定，届时您不应以未阅读本协议的内容或未获得“{{oemName}}”对您问询的解答等理由，主张本协议无效，或要求撤销本协议。若您对本协议的条款，存在任何疑问，请您立刻联系“{{oemName}}”工作人员，若您不同意本协议，您应立即停止注册或停止使用“{{oemName}}”服务。
    本协议由您和“{{oemName}}”运营方{{companyName}}订立，具有合同效力。

一、注册与账户
1.1 主体资格
您确认，在您完成注册程序或以其他“{{oemName}}”允许的方式实际使用“{{oemName}}”服务时，您应当符合下列条件之一:
1.1.1 年满十八岁，并具有民事权利能力和民事行为能力的自然人。
1.1.2 无民事行为能力人或限制民事行为能力人应在其监护人的监护下使用“{{oemName}}”服务。
1.1.3 根据中国法律、法规、行政规章成立并合法存在的机关、企事业单位、个体工商户、社团组织和其他组织。
1.2 用户的账号、密码和安全性
一旦注册成功，您将获得平台账号。如因您未保管好自己的账号或密码而对您、“{{oemName}}”或第三方造成损害的，您将负全部责任。另外，每个用户都要对其账户中的所有活动和事件负全责。
二、“{{oemName}}”服务
2.1 您可以在“{{oemName}}”上查询需求或服务、达成意向并进行交易，参加“{{oemName}}”发布的活动以及使用其它信息，具体以平台提供的内容为准。
2.2 您在“{{oemName}}”上与其他平台用户发生纠纷时，一旦您或其它用户任一方或双方共同提交“{{oemName}}”要求调查处理，则“{{oemName}}”作为独立第三方，有权根据单方判断做出调查处理决定，您了解并同意接受“{{oemName}}”的判断和调查处理决定。
2.3 您了解并同意，“{{oemName}}”有权应政府部门（包括司法及行政部门）的要求，向其提供您向“{{oemName}}”提供的用户信息和交易记录等必要信息。如您涉嫌侵犯他人知识产权等合法权益，则“{{oemName}}”亦有权在初步判断涉嫌侵权行为存在的情况下，向权利人提供您必要的身份信息。
2.4 您应当自行承担因交易产生相关成本等费用，并依法纳税。
2.5 拒绝提供担保和免责声明
    您明确同意使用“{{oemName}}”服务的风险由您个人承担。服务提供是建立在免费的基础上。“{{oemName}}”明确表示不提供任何类型的担保，不论是明确的或隐含的。

三、“{{oemName}}”服务使用规范
3.1 使用“{{oemName}}”服务过程中，您承诺遵守以下约定：
3.1.1 实施的所有行为均遵守国家法律法规等规范性文件及“{{oemName}}”各项规则和要求，不违背社会公共利益或公共道德，不损害他人的合法权益，不偷逃应缴税费，不违反本协议及相关规则。
3.1.2 遵守诚实信用原则，不采取不正当竞争行为，不扰乱网上交易的正常秩序，不从事与网上交易无关的行为。
3.1.3 不发布国家禁止销售的或限制销售的服务信息（除非取得合法且足够的许可），不发布涉嫌侵犯他人知识产权或其它合法权益的服务信息，不发布违背社会公共利益或公共道德的服务信息，不发布其它涉嫌违法或违反本协议及各类规则的信息。
3.1.4 不采取不正当手段（包括但不限于虚假需求、互换好评等方式）提高自身或他人评价，或采用不正当手段恶意评价其他用户，降低其他人评价。
3.1.5 未经公司书面许可，不对“{{oemName}}”上的任何数据作商业性利用，包括但不仅限于在未经“{{oemName}}”事先书面同意的情况下，以复制、传播等任何方式使用“{{oemName}}”网站上展示的资料。
3.1.6 不使用任何装置、软件或例行程序干预或试图干预“{{oemName}}”的正常运作。不得采取任何将导致不合理的庞大数据负载加诸“{{oemName}}”网络设备的行为。
3.2 您了解并同意：
3.2.1 如果违反前述承诺，产生任何法律后果的，您应以自己的名义独立承担所有的法律责任，并确保“{{oemName}}”免于因此产生任何损失或增加费用。
3.2.2 基于维护“{{oemName}}”交易秩序及交易安全的需要，“{{oemName}}”有权在发生恶意交易等扰乱市场正常交易秩序的情形下，执行强制关闭相应交易订单等操作。
3.2.3 经国家行政或司法机关的生效法律文书确认您存在违法或侵权行为，或者“{{oemName}}”根据自身的判断，认为您的行为涉嫌违反法律法规或涉嫌违反本协议规则条款的，则“{{oemName}}”有权公示您的该等涉嫌违法或违约行为。
3.2.4 对于您在“{{oemName}}”上发布的涉嫌违法、涉嫌侵犯他人合法权利或违反本协议和规则的信息，“{{oemName}}”有权不经通知即予以删除，且按照规则进行处罚。
3.2.5 对于您违反本协议项下承诺，或您在“{{oemName}}”上实施的行为，包括您未在“{{oemName}}”上实施但已经对“{{oemName}}”及其用户产生影响的行为，“{{oemName}}”有权单方认定您行为的性质及是否构成对本协议规则的违反，并根据单方认定结果适用规则予以处理或终止向您提供服务，且无须征得您的同意或提前通知予您。您应自行保存与您行为有关的全部证据，并应对无法提供充要证据而承担的不利后果。
3.2.6 如您涉嫌违反有关法律或者本协议规定，使“{{oemName}}”遭受任何损失，或受到任何第三方的索赔，或受到任何行政管理部门的处罚，您应当赔偿“{{oemName}}”因此造成的损失发生的费用，包括合理的律师费用。
3.3 您承诺：遵守“{{oemName}}”的所有其他规定和程序，不利用“{{oemName}}”的服务从事以下活动:
3.3.1 未经允许，进入计算机信息网络或者使用计算机信息网络资源的；
3.3.2 未经允许，对计算机信息网络功能进行删除、修改或者增加的；
3.3.3 未经允许，对进入计算机信息网络中存储、处理或者传输的数据和应用程序进行删除、修改或者增加的；
3.3.4 故意制作、传播计算机病毒等破坏性程序的；
3.3.5 其他危害计算机信息网络安全的行为。

四、特别授权
    您完全理解并不可撤销地授予“{{oemName}}”及其{{companyName}}指定的第三方结算平台下列权利：
4.1 您完全理解并不可撤销地授权“{{oemName}}”或“{{oemName}}”授权的第三方结算平台或您与“{{oemName}}”一致同意的第三方结算平台，根据本协议及“{{oemName}}”规则的规定，处理您在“{{oemName}}”上发生的所有交易及可能产生的交易纠纷。您同意接受“{{oemName}}”或“{{oemName}}”授权的第三方结算平台或您与“{{oemName}}”一致同意的第三方结算平台的判断和调查处理决定。该决定将对您具有法律约束力。
4.2 一旦您向“{{oemName}}”和第三方结算平台做出任何形式的承诺，且相关公司已确认您违反了该承诺，则“{{oemName}}”有权立即按您的承诺或协议约定的方式对您的账户采取限制措施，包括中止或终止向您提供服务，并公示相关公司确认的您的违约情况。您了解并同意，“{{oemName}}”无须就相关确认与您核对事实，或另行征得您的同意，且“{{oemName}}”无须就此限制措施或公示行为向您承担任何的责任。
4.3 对于您提供的资料及数据信息，您授予“{{oemName}}”及第三方结算平台永久免费的许可使用权利(并有权在多个层面对该权利进行再授权)。此外，“{{oemName}}”及其关联公司有权(全部或部分)使用、复制、修订、改写、发布、翻译、分发、执行和展示您的全部资料数据（包括但不限于注册资料、交易行为数据及全部展示于“{{oemName}}”的各类信息）或制作其派生作品，并以现在已知或日后开发的任何形式、媒体或技术，将上述信息纳入其它作品内。

五、责任范围和责任限制
5.1 “{{oemName}}”负责按“现状”和“可得到”的状态向您提供服务。但“{{oemName}}”对服务不作任何明示或暗示的保证，包括但不限于“{{oemName}}”服务的适用性、没有错误或疏漏、持续性、准确性、可靠性、适用于某一特定用途。同时，“{{oemName}}”也不对服务所涉及的技术及信息的有效性、准确性、正确性、可靠性、稳定性和及时性做出任何承诺和保证。
5.2 您了解“{{oemName}}”仅作为您获取需求和服务信息、物色交易对象、就服务的交易进行协商及开展交易的场所，平台上的服务和需求信息系由用户自行发布，且可能存在风险和瑕疵，“{{oemName}}”无法完全控制交易所涉及的服务的质量、安全或合法性，信息的真实性或准确性，以及交易各方履行其在协议中各项义务的能力。您应自行谨慎判断确定相关信息的真实性、合法性和有效性，并自行承担因此产生的责任与损失。
5.3 除法律法规明确要求，或出现以下情况，否则，“{{oemName}}”没有义务对所有用户的信息数据、服务信息、交易行为以及与交易有关的其它事项进行事先审查：
5.3.1 “{{oemName}}”有合理的理由认为特定用户及具体交易事项可能存在重大违法或违约情形。
5.3.2 “{{oemName}}”有合理的理由认为用户在“{{oemName}}”的行为涉嫌违法或其他不当。
5.4 “{{oemName}}”或其授权的第三方结算平台或您与“{{oemName}}”一致同意的第三方结算平台有权基于您不可撤销的授权受理您与其他会员因交易产生的争议，并有权单方判断与该争议相关的事实及应适用的规则，进而做出处理决定，包括但不限于调整相关订单的交易状态，争议款项的全部或部分支付给交易一方或双方。该处理决定对您有约束力。如您未在限期内执行处理决定的，则“{{oemName}}”有权利（但无义务）直接使用您账户内的款项，或您向“{{oemName}}”及第三方结算平台交纳的保证金代为支付。您应及时补足保证金并弥补“{{oemName}}”及第三方结算平台的损失，否则“{{oemName}}”及第三方结算平台有权直接抵减您在其它合同项下的权益，并有权继续追偿。
5.5 您理解并同意，“{{oemName}}”或“{{oemName}}”授权的第三方结算平台或您与“{{oemName}}”一致同意的第三方结算平台并非司法机构，仅能以普通人的身份对证据进行鉴别，“{{oemName}}”或“{{oemName}}”授权的第三方结算平台或您与“{{oemName}}”一致同意的第三方结算平台对争议的调查处理完全是基于您不可撤销的授权，其无法保证争议处理结果符合您的期望，也不对争议调处结论承担任何责任。如您因此遭受损失，您同意自行向受益人索偿。
5.6 您了解并同意，“{{oemName}}”不对因下述任一情况而导致您的任何损害赔偿承担责任，包括但不限于利润、商誉、数据等方面的损失或其它无形损失的损害赔偿(无论“{{oemName}}”是否已被告知该等损害赔偿的可能性)：
5.6.1 使用或未能使用“{{oemName}}”服务。
5.6.2 第三方未经批准的使用您的账户或更改您的数据。
5.6.3 通过“{{oemName}}”交易服务或获取任何平台增值服务、数据、信息或进行交易等行为或替代行为产生的费用及损失。
5.6.4 您对“{{oemName}}”服务的误解。
5.6.5 任何非因“{{oemName}}”的原因而引起的与“{{oemName}}”服务有关的其它损失。
5.7 不论在何种情况下，“{{oemName}}”均不对由于信息网络正常的设备维护，信息网络连接故障，电脑、通讯或其他系统的故障，电力故障、罢工、劳动争议、暴乱、起义、骚乱、生产力或生产资料不足、火灾、洪水、风暴、爆炸、战争、政府行为、司法行政机关的命令或第三方的不作为而造成的不能服务或延迟服务承担责任。

六、协议终止
6.1 您同意，“{{oemName}}”有权自行全权决定以任何理由不经事先通知的中止、终止向您提供部分或全部“{{oemName}}”服务，暂时冻结或永久冻结（注销）您的账户在“{{oemName}}”的权限，且无须为此向您或任何第三方承担任何责任。
6.2 出现以下情况时，“{{oemName}}”有权直接以注销账户的方式终止本协议，并有权永久冻结（注销）您的账户在“{{oemName}}”的权限和收回账户对应的“{{oemName}}”昵称：
6.2.1 “{{oemName}}”终止向您提供服务后，您涉嫌再一次直接或间接以他人名义注册为“{{oemName}}”用户的。
6.2.2 您提供的电子邮箱不存在或无法接收电子邮件，且没有任何其他方式可以与您进行联系，或“{{oemName}}”以其它联系方式通知您更改电子邮件信息，而您在“{{oemName}}”通知后三个工作日内仍未更改为有效的电子邮箱的。
6.2.3 您提供的用户信息中的主要内容不真实或不准确或不及时或不完整。
6.2.4 本协议（含规则）变更时，您明示并通知“{{oemName}}”不愿接受新的服务协议的。
6.2.5 其它“{{oemName}}”认为应当终止服务的情况。
6.2.6 您若反对任何服务条款的建议或对后来的条款修改有异议，或对“{{oemName}}”服务不满，您只有以下的追索权：
6.2.6.1 不再使用“{{oemName}}”服务。
6.2.6.2 结束用户使用“{{oemName}}”服务的资格。
6.2.6.3 通告“{{oemName}}”停止该用户的服务。
结束用户服务后，即协议终止。您使用“{{oemName}}”服务的权利马上中止。从那时起，“{{oemName}}”不再对您承担任何义务。
6.3 您的账户服务被终止或者账户在“{{oemName}}”的权限被永久冻结（注销）后，“{{oemName}}”没有义务为您保留或向您披露您账户中的任何信息，也没有义务向您或第三方转发任何您未曾阅读或发送过的信息。
6.4 您同意，您与“{{oemName}}”的合同关系终止后，“{{oemName}}”仍享有下列权利：
6.4.1 继续保存您的用户信息及您使用“{{oemName}}”服务期间的所有交易信息。
6.4.2 您在使用“{{oemName}}”服务期间存在违法行为或违反本协议和/或规则的行为的，“{{oemName}}”仍可依据本协议向您主张权利。
6.5 “{{oemName}}”中止或终止向您提供“{{oemName}}”服务后，对于您在服务中止或终止之前的交易行为依下列原则处理，您应独力处理并完全承担进行以下处理所产生的任何争议、损失或增加的任何费用，并应确保“{{oemName}}”免于因此产生任何损失或承担任何费用：
6.5.1 您在服务中止或终止之前已经上传至“{{oemName}}”的服务交易尚未交易的，“{{oemName}}”有权在中止或终止服务的同时删除此项服务交易的相关信息；
6.5.2 您在服务中止或终止之前已经与其他用户达成服务约定的，但约定尚未实际履行的，“{{oemName}}”有权删除该任务及其交易服务的相关信息；
6.5.3 您在服务中止或终止之前已经与其他用户达成约定且已部分履行的，“{{oemName}}”可以不删除该项交易，但“{{oemName}}”有权在中止或终止服务的同时将相关情形通知您的交易对方。

七、隐私权政策
7.1 为确保网站正常高效运转、为您获得更轻松的访问体验、向您推荐您可能感兴趣的内容，我们会在您的计算机或移动设备上存储名为Cookie的小数据文件。Cookie会帮助您在后续访问我们网站时调用您的信息，简化您填写个人信息(例如一键登录等)的流程;为您提供安全访问的偏好设置;帮助您优化对广告的选择与互动;保护您的数据安全等。
7.2 我们不会将 Cookie用于本隐私政策所述目的之外的任何用途。您可根据自己的偏好管理或删除 Cookie。您可以清除计算机或移动设备上保存的所有 Cookie，您有权接受或拒绝Cookie。大多数浏览器会自动接受Cookie，但您通常可根据自己的需要来修改浏览器的设置以拒绝Cookie;另外，您也可以清除软件内保存的所有Cookie。但您可能因此无法完全体验我们某些便捷性和安全性的服务功能。

八、知识产权条款
8.1 “{{oemName}}”之域名、商标，以及所有信息内容（用户发布的信息除外），包括但不限于网站架构、文字、图片、软件、音频、视频、用户等级/评价体系/信用体系/榜单等数据信息，以及所有“{{oemName}}”使用之所有技术、数据分析模型、计算机软件、数据库（第三方创建并保留所有权和/或知识产权的除外），其所有权知识产权均归属“{{oemName}}”唯一所有，未经“{{oemName}}”书面许可，任何人均不得擅自进行全部和局部复制、转载、引用和链接等使用。
8.2 用户“{{oemName}}”发布的任何信息和内容（用户隐私信息除外），包括但不限于文字、图片、软件、音频、视频等，均被视为永久、免费且不可撤销地许可“{{oemName}}”自行或许可其关联方、业务合作方、宣传方不受任何限制的使用。
8.3 任何单位或者个人不得以任何方式引诱用户或者第三方复制转载“{{oemName}}”的信息内容，或者同意该用户或者第三方复制转载“{{oemName}}”内容。
8.4 任何违反“{{oemName}}”知识产权声明的行为，“{{oemName}}”保留进一步追究法律责任的权利。

九、法律适用、管辖与其他
9.1 本协议之效力、解释、变更、执行与争议解决均适用中华人民共和国大陆地区法律，如无相关法律规定的，则应参照通用国际商业惯例或行业惯例。
9.2 因本协议产生之争议需根据您使用的服务归属的平台确定具体的争议对象，因您使用“{{oemName}}”服务所产生的争议应由“{{oemName}}”的经营者与您直接沟通并处理。一旦产生不可调和的争议，您与“{{oemName}}”的经营者均同意该争议统一归“{{oemName}}”平台所在地相应级别的法院管辖。
9.3 本协议以其中文版本为最终生效版本。

签署声明：
“{{oemName}}”将在“{{oemName}}”公布并不时修订本协议内容，修订后的协议内容构成本协议的有效组成部分。

您已经充分知悉且已理解本协议全部内容，保证网络流程操作者已获有效授权并足以代表自己或者授权人订立本协议。本协议有效期自您在“{{oemName}}”点击“提交”、“注册”、“同意”、“登录”等类似确认方式时起生效，长期有效。

本协议采用电子文本形式制成，您认可该形式协议的法律效力。您不得以未当面签署书面协议为由主张本协议无效。

  </view>
</view>
</template>

<script>

export default {
  data() {
    return {
		oemName:'开薪客',
		companyName: '安徽职汇信息技术有限公司', //定时器
	};	
  },

  components: {},
  props: {},

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function (options) {
	  
	  this.$request('/oem/set/get/domain', {
	  	// 传参参数名：参数值,如果没有，就不需要传
	  	"domain": window.location.host
	  }).then(res => {	  	
	  	this.oemName=res.obj.oemName
	    this.companyName=res.obj.companyName
	  })
  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function () {},

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function () {},

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function () {},

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function () {},

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function () {},

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function () {},

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function () {},
  methods: {}
};
</script>
<style>
@import "./agreement.css";
</style>